app/controllers/admin/projects_controller.rb

INSERT INTO "projects" ("name", "user_id", "description", "x_axis", "y_axis", "created_at", "updated_at", "consent", "consent2", "with_timer") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    p = project_params
    if p[:name] == '' || p[:description] == '' || p[:consent] == ''|| p[:consent2] == '' || p[:x_axis] == '' || p[:y_axis]== ''
      flash[:alert] = 'Every item must be filled in.'
    else
      proj = Project.create(p)
      current_user.projects << proj

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ?, "consent" = ?, "consent2" = ? WHERE "projects"."id" = ?  [["description", "テストです。"], ["updated_at", "2025-04-17 13:16:57.206050"], ["consent", "あさああああ"], ["consent2", "ああああ"], ["id", 2]]
---
  def update
    p = project_params
    if p[:name] == '' || p[:description] == '' || p[:consent] == ''|| p[:consent2] == '' || p[:x_axis] == '' || p[:y_axis]== ''
      flash[:alert] = 'Every item must be filled in.'
    else
      proj = Project.find(params[:id])
      proj.update(p)