app/controllers/projects_controller.rb

  def consent
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def intro
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def eval
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def result
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def average
    results = []
    for image in params[:img] do
      ave_x = Score.where(image: image, x: true).average(:value)
      ave_y = Score.where(image: image, x: false).average(:value)
---
SELECT AVG("scores"."value") FROM "scores" WHERE "scores"."image_id" = ? AND "scores"."x" = ?  [["image_id", 12], ["x", 1]]
SELECT AVG("scores"."value") FROM "scores" WHERE "scores"."image_id" = ? AND "scores"."x" = ?  [["image_id", 12], ["x", 0]]