app/controllers/scores_controller.rb

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "scores" ("value", "x", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", 0.54], ["x", 1], ["image_id", 4], ["created_at", "2025-04-17 13:01:20.841724"], ["updated_at", "2025-04-17 13:01:20.841724"]]
INSERT INTO "scores" ("value", "x", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", -0.47], ["x", 0], ["image_id", 4], ["created_at", "2025-04-17 13:01:20.848739"], ["updated_at", "2025-04-17 13:01:20.848739"]]
---
  def create
    p = score_params
    for i in 0..5 do
      image = Image.find(p["i#{i}"])
      sx = Score.create(value: p["x#{i}"].to_f, x: true)
      sy = Score.create(value: p["y#{i}"].to_f, x: false)
      image.scores << sx
      image.scores << sy